# Procesamiento de datos
Fecha: 22 Enero 2022 

## Repaso: Jupyter notebook

Vamos a usar dos tipos de celdas: Code y Markdown

In [4]:
# En las celdas con código se puede escribir (comentar) usando 
# Ejemplo:

Las celdas tipo Markdown sirven para incluir texto. Se pueden usar algunas opciones de latex, como usar texto en **negrita**, escribir fórmulas $y = x^2 + a_1$, etc. Se puede activar haciendo "Esc + M" o desde Cell/Cell type/Code o Markdown.

## Repaso: Listas y diccionarios

**Listas** <br>
Las listas son como su propio nombre indica una lista de datos en los que hay orden. Que haya orden, significa que se tiene en cuenta la posición en la que esta cada elemento. Combiene recordar que el primer elemento de una lista en Python es el 0 y no el 1. Se crean escribiendo sus elementos entre corchetes

In [7]:
# Ejemplos de lista:
mi_lista = [5, 6, 7, 8, 9]
print('Ejemplo de lista numérica:' + str(mi_lista))

mi_lista_b = ["verde", "rojo", "azul", "rosa", "blanco", "amarillo"]
print(mi_lista_b)

Ejemplo de lista numérica:[5, 6, 7, 8, 9]
['verde', 'rojo', 'azul', 'rosa', 'blanco', 'amarillo']

In [5]:
#Ejemplo, como seleccionar un elemento:
mi_lista_b[3]

'rosa'

Algunas operaciones habituales con listas son:

- mi_lista[i]: Devuelve el elemento que está en la posición i de la lista. <br>
- mi_lista.pop(i): Devuelve el elemento en la posición i de una lista y luego lo borra. <br>
- mi_lista.append(elemento): Añade elemento al final de la lista. <br>
- mi_lista.insert(i, elemento): Inserta elemento en la posición i. <br>
- mi_lista.extend(lista2): Fusiona lista con lista2. <br>
- mi_lista.remove(elemento): Elimina la primera vez que aparece elemento. <br>

In [10]:
# Practica aquí estas operaciones

**Diccionarios**<br>
En Python, un diccionario consta de palabras que tienen asociado algo, como en los diccionarios convencionales. Se construyen escribiendo sus elementos entre llaves {"palabra 1" : "definicion 1", "palabra 2" : "definicion 2",...}. A las "palabras" se les denominan keys y values a sus "definiciones".  No puede haber dos keys iguales, pero sí dos values iguales. Al contrario que las listas, los diccionarios no tienen orden.

In [15]:
# Ejemplo de diccionario:
mi_diccionario = {'Color 1':'verde','Color 2':'rojo','Color 3':'azul','Color 4':'naranja'}
print(mi_diccionario)

{'Color 1': 'verde', 'Color 2': 'rojo', 'Color 3': 'azul', 'Color 4': 'naranja'}

Igual que en los diccionarios convencionales a cada palabra se puede dar varios significados, en los diccionarios de Python, por cada key puede haber varios elementos. Esto se puede conseguir escribiendo una lista por cada elemento.

In [19]:
# Ejemplo:
mi_diccionario = {'Colores':['verde','rojo','azul','naranja'], 
                  'Formas': ['cuadrado', 'circulo', 'triangulo', 'rectangulo'],
                 'Tamano': ['grande', 'mediano', 'pequeno']}
print(mi_diccionario)

{'Colores': ['verde', 'rojo', 'azul', 'naranja'], 'Formas': ['cuadrado', 'circulo', 'triangulo', 'rectangulo'], 'Tamano': ['grande', 'mediano', 'pequeno']}

Algunas operaciones habituales con diccionarios son:

- mi_diccionario.get('key'): Devuelve el valor que corresponde con la key introducida. <br>
- mi_diccionario.pop('key'): Devuelve el valor que corresponde con la key introducida, y luego borra la key y el valor.<br>
- mi_diccionario.update({'key':'valor'}): Inserta una determinada key o actualiza su valor si ya existiera. <br>
- 'key' in mi_diccionario: Devuelve verdadero (True) o falso (False) si la key (no los valores) existe en el diccionario.<br>
- 'definicion' in mi_diccionario.values(): Devuelve verdadero (True) o falso (False) si definición existe en el diccionario (no como key).<br>

In [25]:
# Practica aquí las diferentes operaciones
# Ejemplos:

#mi_diccionario.get('Colores')

'Colores' in mi_diccionario

True

## Pandas


Pandas es una librería de código abierto de Python para la manipulación y el análisis de datos. Ofrece estructuras de datos y operaciones para manipular tablas numéricas y series temporales. Su nombre viene de "PANel DAta"

Pandas Dataframe: Conjunto de datos tabulados en dos dimensiones en el cual se puede guardar datos de distintos tipos (caractéres, enteros, valores de punto flotante,etc.). Es similar a una hoja de cálculo o una tabla de SQL.

Pandas Series: Es un array 1D capaz de contener cualquier tipo de datos. Una Serie representa una columna, que puede ser independiente o pertenecer a un Pandas Dataframe.

Para trabajar con la librería pandas, primero tenemos que importarla:

In [27]:
# Importamos la librería pandas con el nombre corto pd:
import pandas as pd

Hay muchas formas diferentes de crear un dataframe.<br>

Por ejemplo vamos a crear un dataframe a partir de un diccionario:

In [36]:
# Creamos un diccionario hecho de listas:
mi_diccionario = {'A':['1', '2', '3'],'B':[4,5,6],'C':[7,8,9]}

# Creamos el dataframe a partir del diccionario
df = pd.DataFrame(mi_diccionario)

# Veamos que pinta tiene:
df

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

Tambien podemos crear un dataframe a partir de una lista de listas:

In [51]:
# Creamos un diccionario a partir de una lista de listas
df = pd.DataFrame([[1,2,3], [4,5,6], [7,8,9]], columns=['A','B','C'], index = ['row 1','row 2','row 3'])
# Nota, fíjate como se pueden nombrar las columnas y las filas.
df

       A  B  C
row 1  1  2  3
row 2  4  5  6
row 3  7  8  9

Para mas ejemplos ver: https://www.geeksforgeeks.org/different-ways-to-create-pandas-dataframe/ <br>

Vamos a crear un DF mas 'real' con el que practicar:

In [43]:
df_viviendas = pd.DataFrame([['Comercio', '0', 2, 90, 'alquilado'],
                             ['Apartamento', '1', 3, 50, 'sin alquilar'],
                             ['Apartamento', '1', 2, 40, 'alquilado'],
                             ['Apartamento', '2', 3, 50, 'alquilado'],
                             ['Apartamento', '2', 2, 40, 'sin alquilar'],
                             ['Estudio', '3', 1, 32, 'alquilado']],
                            columns=['Inmueble', 'Planta', 'Habitaciones', 'Metros^2', 'Estado'],
                            index = ['Vivienda 1', 'Vivienda 2', 'Vivienda 3', 'Vivienda 4', 'Vivienda 5', 'Vivienda 6'])



df_viviendas

               Inmueble Planta  Habitaciones  Metros^2        Estado
Vivienda 1     Comercio      0             2        90     alquilado
Vivienda 2  Apartamento      1             3        50  sin alquilar
Vivienda 3  Apartamento      1             2        40     alquilado
Vivienda 4  Apartamento      2             3        50     alquilado
Vivienda 5  Apartamento      2             2        40  sin alquilar
Vivienda 6      Estudio      3             1        32     alquilado

### Tipos de variable:

#### Variables numericas:
**Variables Discretas**: <br>
Son también llamadas discontinuas, y están asociadas a conteos o enumeraciones, razón por la cual, solo permiten ser registradas con números enteros (0,1,2,3, etc.)<br>
**Variables Continuas**: <br>
Son aquellas características que son medidas dentro de un rango continuo infinito de valores numéricos y se registran con números reales. Pueden presentar cualquier valor dentro de cierto intervalo.<br>


#### Variables categoricas:
**Variable Nominal**: <br>
Es aquella variable cualitativa cuya categoría no sigue ningún orden, se agrupa sin ninguna jerarquía entre sí.<br>
**Variable Ordinal**:<br>
Son aquellas variables categóricas con orden secuencial o progresión natural esperable o jerarquía.

**Ejercicio:** Que tipode variable es cada columna?

### Datos básicos de un dataframe

Una vez que hemos creado o leído un dataset en un DataFrame, es el momento de comenzar a obtener datos sobre ellos.
Para ello, podemos usar una serie de operaciones que nos permiten obtener valores importantes. Por ejemplo:

- **df.shape** Número de filas y columnas de un DataFrame. 
- **df.index** Descripción del índice de filas del DataFrame. 
- **df.columns** Descripción de las columnas del DataFrame. 
- **df.info()** Información general sobre el DataFrame. 
- **df.count()** Cuenta el número de valores no nulos del DataFrame. 
- **df.head(n=5)** Muestra las n primeras filas del DataFrame, por defecto 5. 
- **df.tail(n=5)** Muestra las n últimas filas del DataFrame, por defecto 5.

In [49]:
df.shape

(3, 3)

In [52]:
df.index

Index(['row 1', 'row 2', 'row 3'], dtype='object')

In [53]:
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [54]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, row 1 to row 3
Data columns (total 3 columns):
A    3 non-null int64
B    3 non-null int64
C    3 non-null int64
dtypes: int64(3)
memory usage: 96.0+ bytes

In [56]:
df.count()

A    3
B    3
C    3
dtype: int64

In [57]:
df.head()

       A  B  C
row 1  1  2  3
row 2  4  5  6
row 3  7  8  9

In [58]:
df.tail()

       A  B  C
row 1  1  2  3
row 2  4  5  6
row 3  7  8  9

**Ejercicio:** Que tamano tiene el dataframe df_viviendas?

**Ejercicio:** Como se llaman sus indices y columnas? Que typo de datos son?

**Ejercicio:** Que información puedes obtener de cada columna? Qué tipo es cada una?

**Ejercicio:** Cuantos valores no nulos hay por columna?

**Ejercicio:** Muestra las dos primeras filas del dataframe.

**Ejercicio:**  Muestra las dos últimas filas del dataframe

**Ejercicio:**  Que podemos aprender si usamos .describe()? Aplícalo en df_viviendas y comenta que valores devuelve

### Funciones de acceso

Los DataFrames son estructuras indexadas por filas y por columnas. Se pueden utilizar estos índices para acceder a los contenidos del dataset que almacenan usando el mecanismo de slicing, exactamente igual que en las listas y los arrays de Numpy (mi_array[fila,columna]. Veamos algunos ejemplos:

In [67]:
df # Este era nuestro dataframe

       A  B  C
row 1  1  2  3
row 2  4  5  6
row 3  7  8  9

In [74]:
# Obtenemos la primera fila:
df[0:1]

       A  B  C
row 1  1  2  3

In [76]:
# Obtenemos la segunda fila:
df[1:2]

       A  B  C
row 2  4  5  6

In [119]:
# Obtenemos las dos primeras filas:
df[0:2]

       A  B  C
row 1  1  2  3
row 2  4  5  6

In [77]:
# Obtenemos la primera columna:
df['A']

row 1    1
row 2    4
row 3    7
Name: A, dtype: int64

In [118]:
# Obtenemos las dos primeras columna:
df[['A', 'B']]

       A  B
row 1  1  2
row 2  4  5
row 3  7  8

In [82]:
# Obtenemos el tercer elemento de la segunda columna:
df['B'][2:3] # El orden es indiferente, df[2:3]['B'] tambien valdría

row 3    8
Name: B, dtype: int64

**Ejercicio** De que tipo es df['B'][2:3]?

El resultado de este acceso es una Serie, no un valor. En la mayoría de los casos nos va a interesar acceder al valor puro, con su correspondiente tipo, y no obtenerlo almacenado en un DataFrame de una sola fila y columna. Para ello, usaremos las siguientes funciones de acceso a valores:

- **df.loc** Acceso por etiqueta, siendo la etiqueta el índice (fila o columna). 
- **df.iloc** Acceso por posición entera. 
- df.at Acceso rápido por etiqueta, orientado a un solo elemento. 
- df.iat Acceso rápido por posición entera, orientado a un solo elemento. 
- df.ix Acceso por etiqueta o por posición. Se considera retirado (deprecated) porque resulta confuso.

Ejemplo: Obtener el tercer elemento de la segunda columna con .loc

In [91]:
df.loc['row 3','B']

8

**Ejercicio** Comprobar que df.loc['row 3','B'] es de tipo numérico

**Ejercicio** Como obtenemos el tercer elemento de la segunda columna con .iloc?

**Ejercicio** Como obtenemos la segunda y tercera fila con .loc? y con .iloc?

       A   B  C
row 2  4   5  6
row 3  7  17  9

**Ejercicio** Como obtenemos las dos primeras columnas con .loc? y con .iloc?

       A   B
row 1  1   2
row 2  4   5
row 3  7  17

Ejemplo: Obten los datos en la fila 3 la columna B con .iat .at

In [ ]:
df.at['row 3','B']
df.iat[2,1]

#### Diferencias entre .loc, .iloc, .at y .iat

- iloc y loc pueden seleccionar multiples files y/o columnas. Potencialmente para hacer vectorizaciones.
- iat y at solo pueden acceder a valores escalares. Es decir, no valen para hacer slicings. Son la versión rápida de iloc y loc.


- at y loc solo trabajan con indices.
- iat y iloc solo trabajan con posiciones.

Las funciones de acceso nos valen para seleccionar elementos y trabajar con ellos, pero tambien para reemplazarlos.
**Ejercicio** Reemplaza el valor 8 del df por el valor 17.

In [146]:
df.loc['row 3','B'] = 17
df

       A   B  C
row 1  1   2  3
row 2  4   5  6
row 3  7  17  9

**Ejercicio** Volviendo al dataframe df_viviendas, y usando tus funciones de acceso favoritas, como podemos obtener los metros cuadrados de la vivienda 4?

**Ejercicio** Cuantas habitaciones tiene la vivienda 5?

**Ejercicio** En que planta  estan y cuantos metros cuadrados tienen las viviendas 2 y 6? Hazlo en una sola linea de código.

Valores únicos:<br>
**Ejercicio** Cuantos tipos de inmueble hay en el dataframe df_viviendas?

array(['Comercio', 'Apartamento', 'Estudio'], dtype=object)

### Agreagar filas y columnas a un dataframe

Ya hemos visto como cambiar uno o varios elementos en el data frame. Ahora vamos a ver como agregar filas y columnas. Veamos algunos ejemplos con nuestro dataframe df.

Ejemplo: Agregar una columa D con valores 10, 11 y 12 a df

In [167]:
df['D'] = [10,11,12]
df

       A   B  C   D
row 1  1   2  3  10
row 2  4   5  6  11
row 3  7  17  9  12

Ejemplo: Agregar una fila row 4 con valores 1, 10, 100 y 1000 a df

In [171]:
df.loc['row 4'] = [1, 10, 100, 1000]
df

       A   B    C     D
row 1  1   2    3    10
row 2  4   5    6    11
row 3  7  17    9    12
row 4  1  10  100  1000

**Ejercicio** Agrega la columna Precio, con los valores que tu quieras a df_viviendas

               Inmueble Planta  Habitaciones  Metros^2        Estado  Precio
Vivienda 1     Comercio      0             2        90     alquilado  190000
Vivienda 2  Apartamento      1             3        50  sin alquilar  120000
Vivienda 3  Apartamento      1             2        40     alquilado  100000
Vivienda 4  Apartamento      2             3        50     alquilado  125000
Vivienda 5  Apartamento      2             2        40  sin alquilar  100000
Vivienda 6      Estudio      3             1        32     alquilado   80000

**Ejercicio** Agrega una nueva vivienda que tu te inventes a df_viviendas

               Inmueble Planta  Habitaciones  Metros^2        Estado  Precio
Vivienda 1     Comercio      0             2        90     alquilado  190000
Vivienda 2  Apartamento      1             3        50  sin alquilar  120000
Vivienda 3  Apartamento      1             2        40     alquilado  100000
Vivienda 4  Apartamento      2             3        50     alquilado  125000
Vivienda 5  Apartamento      2             2        40  sin alquilar  100000
Vivienda 6      Estudio      3             1        32     alquilado   80000
Vivienda 7  Apartamento      1             1        20       vendido      30